# NewUV Method (Double, Double)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..NewUV Method (Double, Double)
Application Class See Also
---
Creates a UV object representing coordinates in 2-space with supplied values.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public UV NewUV(
	double u,
	double v
)
```

Visual Basic
---
```text
Public Function NewUV ( _
	u As Double, _
	v As Double _
) As UV
```

Visual C++
---
```text
public:
UV^ NewUV(
	double u,
	double v
)
```

# ### Parameters
u
    Type: System..::..DoubleThe first coordinate.
v
    Type: System..::..DoubleThe second coordinate.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when setting an infinite number to the U or V property. |

# See Also
Application Class
NewUV Overload
Autodesk.Revit.Creation Namespace